import os
from dotenv import load_dotenv
from pymongo import MongoClient

load_dotenv()

try:
    client = MongoClient(os.getenv("MONGO_URI"))
    db = client['Book_Recommendation_app']
    books = db['Books']

    book = {
        "title": "«Смерть у Венеції» та інші новели",
        "author": "Томас Манн",
        "genre": ["Новели", "Класична література", "Коротка проза", "Література XX століття"],
        "rating": 0,
        "description": "«Перший том вибраної новелістики Томаса Манна у класичних перекладах видатного українського перекладача Євгена Поповича\nУ творчості Томаса Манна новели займають особливе місце. Саме коротка проза стала основою літературної спадщини письменника — від першого літературного дебюту і незадовго до власної смерті. Автор щоразу повертався до новелістики.\nПерший том вибраної новелістики, під звучання опери Ріхарда Вагнера, відкриває новела «Трістан». Далі граційно перетікає в нерозлучну пару — «Тоніо Крегер» та «Смерть у Венеції». Життя художника в одній історії відбувається навколо подорожі з півдня на північ, в іншій — з півночі на південь. Одна подорож закінчується крихким примиренням, а інша — смертю.\nА завершальним акордом першого тому стає новела «Маріо і чарівник». Оповідач описує подорож своєї сім'ї до вигаданого приморського містечка Торре ді Венере, де потрапляє на виступ фокусника і гіпнотизера, на ім'я Чіполла. Але харизматичний штукар використовує власні здібності, щоб контролювати  аудиторію у дуже жорстокий і фашистський спосіб.",
        "img": "mann_cover.jpg"
    }
    
    books.insert_one(book)
    
except Exception as e:
    print(f"Error occurred: {e}")